; @layout  post
; @title   来年から本気出す(といっても今日は大晦日)
; @summary

;;
;;
[:h3 "Blog を始めるにあたって"]

(p "この記事を書いているのは、2012/12/31 22:00 も過ぎた、紅白歌合戦をやっている真っ最中です。実はこのBlog、どういうコンセプトでどういうデザインで書くか、ということばかりに気を取られて、細かな詰めもなにもできておりません。正直、不細工な状態のままでの公開となってしまいました。")

(p "不細工な状態での公開は自分にとってはすごく嫌なのですが、「始めなければなにも始まらない」ということを自分はよく知っているつもりなので、こまかな修正はおいおいやっていくにしても、とりあえずスタートラインには立とう、と思った次第です。")


;;
;;
[:h3 "記事の内容について"]

(p "基本的には「技術系Blog」に徹底しようと思っています。自分の日々の出来事や心情とかはあまり書きません。そのかわり、自分が興味を示している技術的な事柄について、書き記す場にしたいと思っています。")

(p "ただ、「自分が興味を示している技術」といっても幅が広すぎても発散して面白くなくなりそうなので、ソフトウェア関連、位の縛りをかけておきます。")

;;
;;
[:h3 "2012年の振り返りなど"]
(p "自己紹介してもつまらないので、2012年に自分の身の回りであったイベントで簡単に振り返ってみたいと思います。")

;;
[:h3 "2012/04/22 Kyoto.clj 第１回"]
(p "[Kyoto.clj](http://atnd.org/events/27149) というイベントに参加しました。実は自分は社外勉強会への参加はこれが初めてとなります。参加、といってもこのときは聞き手だけでした。")

(p "自分は Clojure に興味を持ったのは 2011年の秋頃で、ネットや本で勉強をしていたのですが、イベントがあると知ったので参加してみることにしました。年齢が年齢だけに(秘密ですが40後半)場違いかな、とも思ったのですが、やはりそこは「始めなければ始まらない」という考えに基づき行ってみました。今となってはこれが今年のその後の自分の行動を変革させる第１歩になってたんですね。")

;;
[:h3 "2012/07/28 Clojure Programming お菓子会"]
(p "[Clojure Programming お菓子会](http://atnd.org/events/30330) に参加しました。このときは、一応自分で何か発表しようと思い、事前に自分が２章を担当すると宣言して、へたくそながらも資料を作って発表しました。")

(slideshare "13782976")

(p "このときは確か参加者が少なく(6名位？)、あまり緊張もしませんでしたが、「なんか貢献したかな？」というちょっとだけハテナがつくものの実績を作っておいてよかったと思っています。やっぱり勉強会は発表したほうが自分の成長にもつながるわけですし。")

;;
[:h3 "2012/08/04 Kyoto.lisp ハッカソン"]
(p "[Kyoto.lisp ハッカソン](http://atnd.org/event/E0007877) というイベントに参加しました。年齢的にもおっさんすぎる自分が参加しても良いものか、と不安はあったのですが、もう気持ち的には「やるしかない」という感じです。Kyoto.lisp #1 というイベントが春にあったのですが、参加できず ustream を見てるだけでしたので、ぜひ参加したいという意思だけは強くもってました。")

(p "ただ、ハッカソンというイベントの性質上、何か自分でも「ネタ」を仕込んでおかないといけないのですが、手持ちで良さげなネタがない...。苦肉の策で、今も使っている Static Site Generator の [misaki](https://github.com/liquidz/misaki) にちょっと手を入れるだけ、というなんともしまらない結果に...。それでも、懇親会で lisp ネタでとても盛り上がり楽しかったのを記憶しています。")

;;
[:h3 "2012/10/21〜24 International Lisp Conference (ILC) 2012"]
(p "[Lisp の国際的なイベントILC2012](http://www.international-lisp-conference.org/2012/index.html) に参加できませんでした orz。いにしえの Lisp マシン動態展示もあるよ、と事前に聞いていたのですが、日程と金銭的問題とで参加できず。ちょっと残念な思いをしました。")

;;
[:h3 "2012/11/10 DevLove 関西2012"]
(p "[DevLove関西2012](http://devlove-kansai.doorkeeper.jp/events/1757) に参加。テクニカルセッションを主に聞いていたのですが、参加者、発表者ともに熱気がすごくて圧倒された一日でした。懇親会なしで申し込んでいたのですが、結局懇親会に参加。懇親会での LT 大会もかなりの勢いだったのですが、自分の方が体調を崩してしまい、パワーを少しもらいそこねてしまった感じです。ちなみに、翌週の土曜日に Scala & Play Framework 勉強会というのがあり参加を申し込んでいたのですが、体調を心配してキャンセルしてしまいました。")

;;
[:h3 "2012/11/24 第２回 関数型言語勉強会 大阪"]
(p "[第２回 関数型言語勉強会 大阪](http://atnd.org/events/33084) に参加しました。定員50名があっという間に埋まるという、恐ろしく人気の高い勉強会。人気が高いのは事前に知っていたので、早めに会場に入り、わりと前の方の席に座れたので、発表内容もはっきりと聞き取れて、いろいろと勉強になりました。ただ、この場で Clojure に関する発表が無かったので、次回があれば自分がなにかネタを仕込んで発表しようかな、と思っています。(そろそろ仕込み始めないとやばいのか???)")

;;
[:h3 "2012/12/01 関西Javaエンジニアの会スペシャル"]
(p "[関西Javaエンジニアの会スペシャル](http://connpass.com/event/1261/) に参加しました。JavaOne 2012 報告、ということでこちらもかなり勢いがある感じがしました。自分は仕事では、.Net 関連のプロジェクトに関わることが多くなりつつあるのですが、個人的には Java 好きです。できれば今後もずっと Java に関わって行きたいと思っています。")


;;
[:h3 "2012/12/21 第4回大阪Jenkins勉強会"]
(p "[第4回大阪Jenkins勉強会](http://connpass.com/event/1412/) に参加しました。平日の夜、ということで、しかもちょっと体調不良だったのですが、少々無理してでも行ったかいがありました。みんな Jenkins 大好きで、いろいろとノウハウをもっている人たちが、Jenkins コミュニティを引っ張っていっている、そんな力のようなものを感じました。体調が良ければ懇親会行きたかったです。")

;;
[:h3 "アドベントカレンダーも書きました"]
(p "今年は昨年(2011年)以上にいろいろとアドベントカレンダーがあり、自分も無理しない範囲で３つ記事を書きました。")

[:ul
 [:li (p "12/04 Lisp Reader Macro アドベントカレンダー [Clojure のリーダーマクロについて](https://gist.github.com/4195740)")]
 [:li (p "12/06 HENTAI アドベントカレンダー [Clojure から POI ってみる](https://gist.github.com/4216377)")]
 [:li (p "12/11 Lisp アドベントカレンダー [sqlkorma 使ってみた](https://gist.github.com/4252252)")]]

(p "無理しない範囲で、と書きましたが、Lisp アドベントカレンダーは正直スベりましたwww。来年はもっと Lisp 力をつけないと。")

;;
[:h3 "#clojure 入門者向け勉強会 #mitori_clj"]

(p "Clojure 入門者向けの非同期勉強会という名目で [mitori_clj](http://www.zusaar.com/event/455057) というものに参加しています(今も継続中)。[Project Euler](http://projecteuler.net/) の問題を Clojure で解いて、コードを Gist で公開して有識者に突っ込んでもらう、というものです。Clojure も Project Euler も奥が深い...。いろいろと勉強になってます。")

;;
;;
[:h3 "2013年に向けて"]
(p "来年まであと30分を切りましたwww 。2012年はなんだかんだでまとまった量のプログラムといえば Clojure か Emacs Lisp しか書いていない、という驚愕の事実がありました(仕事を休職していたのが大きいのですが...)。来年は、Clojure をどうにかこうにか仕事場に持ち込めないか、考えてみたいですね。")
(p "あと、昨年中途半端な状態で放置しているもの(GIS/MapServer 関連、ClojureCLR、ExcelDNA、etc) をなんとか自分の「味方」に付けることができるようにしたいなぁ。")
